do

function run(msg, matches)
  return [[راهنمای گروه :

/Open | Close file : دسترسی ارسال فایل درگروه
/Open | Close image : دسترسی ارسال عکس در گروه
/Open | Close audio : دسترسی ارسال فایل های صوتی در گروه
/Open | Close sticker : دسترسی ارسال استیکر در گروه
/Open | Close link : دسترسی ارسال لینک و تبلیغات درگروه
/Open | Close chat : دسترسی چت و ارسال هرگونه متن در گروه
[open = امکان ارسال][close = مکان ارسال وجود ندارد]
[مثال][/open file][/close file]

------------------------
[توجه این دستورات فقط فرد را در ربات ادمین میکند]
/promote : ادمین کردن یک نفر در ربات
/demote : از ادمین خارج کردن یک نفر در ربات

[توجه این دستورات فقط فرد را در گروه ادمین میکند]
/spromote : ادمین کردن فرد در گروه
/sdemote : از ادمین در اوردن فرد از گروه

-----------------------
/modlist : نشان دادن افراد ادمین در ربات
/kickme : اخراج کردن شما

-----------------------
[انجام دهید reply|username|id توجه این دستورات را میتوانید با] 
/kick : اخراج کردن فرد
/ban : بن کردن فرد از گروه
/unban : از بن در اوردن فرد از گروه
/block فیلترکردن کلمه در گروه : (کلمه)
/unbloc حذف کردن کلمه از لیست کلمات فیلتر : (کلمه) 
/group settings : دیدن تنظیمات گروه

-----------------------
/setabout : تنظیم درباره برای گروه
/setrules : تنظیم قوانین
/rules : نشان دادن قوانین
/about : نشان دادن درباره گروه
[میباشد reply دستور زیر فقط با]
/delete : حذف پیام و یا هرچیزی که در گروه ارسال شده باشد (فقط با ریپلی بر روی پیام مورد نظر)

-----------------------
/getlink : دریافت لینک گروه
/relink : دریافت لینک جدید گروه
/setname تنظیم اسم گروه : (نام گروه)
/setphoto : تنظیم عکس گروه

-----------------------
[انجام مشودreply دستورات زیر فقط با]
/silent : حذف کردن پیام های یک فرد در گروه
/unsilent : حرف نکردن پیام های فرد در گروه
]]
end
return {
  description = "Shows bot help", 
  usage = "!help me: Shows bot help",
  patterns = {
    "^help me$",
    "^[^$#>/!](help me)$"
  }, 
  run = run 
}

end
